
# Workflow Practice

In this notebook, you’ll practice connecting to a SQLite database, creating tables from CSV files using Pandas, and writing SQL queries to explore the data.

The dataset comes from the [Bike Store Sample Database](https://www.kaggle.com/datasets/dillonmyrick/bike-store-sample-database) by Dillon Myrick. It models a fictional bike retailer with multiple stores, products, customers, and staff. Each table connects to others using foreign keys such as `customer_id`, `store_id`, and `product_id`.

You’ll:
- Connect to a local SQLite database
- Create tables using `pandas.to_sql()`
- Write and test SQL queries using `pd.read_sql()`

All of your work will take place directly in this notebook. Each question prompt is written below as a Markdown cell, followed by an empty code cell for you to write your query.


## Step 1: Connect to the Database

Run the following cell to connect to (or create) a SQLite database called `bike_store.db`.  
If the file doesn’t exist yet, SQLite will automatically create it.

In [2]:
import sqlite3
import pandas as pd

In [3]:
connection = sqlite3.connect("bike_store.db")
connection


## Step 2: Create Tables from CSV Files

The `data/` folder contains one CSV file per table.  
Use `pandas.read_csv()` and `DataFrame.to_sql()` to load each file into your database.

You only need to do this once.  
After that, you’ll be able to run queries against your newly created tables.

In [5]:
# Example for one file
customers = pd.read_csv("data/customers.csv")
customers.to_sql("customers", connection, if_exists="replace", index=False)

1445

In [4]:
# Repeat for all other files in the data folder, or use a loop.
tables = ['data/brands.csv', 'data/categories.csv', 'data/order_items.csv', 'data/orders.csv', 'data/products.csv', 'data/staffs.csv', 'data/stocks.csv', 'data/stores.csv']
for file in tables:
    df = pd.read_csv(file)
    df.to_sql(name = file.replace('.csv', '').replace('data/',''), con = connection, if_exists='replace', index=False)

### Verify Your Tables

Run a query to make sure your tables were created successfully.

In [6]:

pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", connection)

          name
0       brands
1   categories
2  order_items
3       orders
4     products
5       staffs
6       stocks
7       stores
8    customers

## Step 3: Test a Simple Query

Before starting the exercises, confirm your connection and tables are working by previewing the first few rows of the `customers` table.

In [7]:

pd.read_sql("SELECT discount from order_items", connection)

      discount
0         0.20
1         0.07
2         0.05
3         0.05
4         0.20
...        ...
4717      0.07
4718      0.20
4719      0.20
4720      0.07
4721      0.20

[4722 rows x 1 columns]

### Q1. List all customers and their cities.

Return the first name, last name, and city of each customer. Sort alphabetically by last name and then by first name.

In [11]:
# Your query here
query1 = """ 
    select first_name,last_name,city from customers
    order by last_name, first_name;
"""
pd.read_sql(query1, connection)

      first_name  last_name                 city
0          Ester    Acevedo          San Lorenzo
1         Jamika    Acevedo           Ozone Park
2          Penny    Acevedo         Ballston Spa
3       Bettyann     Acosta            Lancaster
4          Shery     Acosta     Saratoga Springs
...          ...        ...                  ...
1440        Edda      Young      North Tonawanda
1441      Jasmin      Young              Helotes
1442  Alexandria     Zamora          Schenectady
1443       Jayme     Zamora  Springfield Gardens
1444       Ollie  Zimmerman              Anaheim

[1445 rows x 3 columns]

### Q2. Show all products and their prices.

Display each product name along with its list price. Sort by price in descending order.

In [ ]:
# Your query here
query2 = """ 
    select product_name, list_price from products
    order by list_price desc;
"""
pd.read_sql(query2, connection)

                               product_name  list_price
0             Trek Domane SLR 9 Disc - 2018    11999.99
1             Trek Domane SLR 8 Disc - 2018     7499.99
2          Trek Silque SLR 8 Women's - 2017     6499.99
3            Trek Domane SL Frameset - 2018     6499.99
4    Trek Domane SL Frameset Women's - 2018     6499.99
..                                      ...         ...
316                    Trek Kickster - 2018      159.99
317         Trek Boy's Kickster - 2015/2017      149.99
318             Trek Girl's Kickster - 2017      149.99
319          Sun Bicycles Lil Kitt'n - 2017      109.99
320  Strider Classic 12 Balance Bike - 2018       89.99

[321 rows x 2 columns]

### Q3. Find all customers from California.

Return first name, last name, city, and state for all customers whose state is 'CA'. Sort alphabetically by last name.

In [14]:
# Your query here
query3 = """ 
    select first_name, last_name, city, state from customers
    where state = 'CA'
    order by last_name;
"""
pd.read_sql(query3, connection)

    first_name  last_name                    city state
0        Ester    Acevedo             San Lorenzo    CA
1       Jamaal     Albert                Torrance    CA
2        Sindy   Anderson                  Pomona    CA
3        Twana     Arnold                 Anaheim    CA
4       Selene     Austin                  Duarte    CA
..         ...        ...                     ...   ...
279     Darren       Witt               Coachella    CA
280       Lucy      Woods  Palos Verdes Peninsula    CA
281       Joel       Wynn               San Diego    CA
282      Yvone      Yates               San Pablo    CA
283      Ollie  Zimmerman                 Anaheim    CA

[284 rows x 4 columns]

### Q4. Count how many products are in each category.

Return the category name and the number of products in that category. Sort from the highest count to the lowest.

In [20]:
# Your query here
query4 = """ 
    select category_name, count(category_name) from products p
    left join categories c
        on p.category_id = c.category_id
    group by category_name
    order by count(category_name) desc;
"""
pd.read_sql(query4, connection)

         category_name  count(category_name)
0    Cruisers Bicycles                    78
1           Road Bikes                    60
2       Mountain Bikes                    60
3    Children Bicycles                    59
4     Comfort Bicycles                    30
5       Electric Bikes                    24
6  Cyclocross Bicycles                    10

### Q5. Find all orders placed in 2018.

List the order ID, order date, and customer ID for orders made during the year 2018. Sort by order date.

In [23]:
# Your query here
query5 = """ 
select order_id, order_date, customer_id from orders 
where strftime('%Y', order_date)='2018'
order by order_date;
"""
pd.read_sql(query5, connection)

     order_id  order_date  customer_id
0        1324  2018-01-01          862
1        1325  2018-01-01           68
2        1326  2018-01-01          567
3        1327  2018-01-02         1026
4        1328  2018-01-02         1083
..        ...         ...          ...
287      1611  2018-09-06            6
288      1612  2018-10-21            3
289      1613  2018-11-18            1
290      1614  2018-11-28          135
291      1615  2018-12-28          136

[292 rows x 3 columns]

### Q6. Show each order with its total number of items.

Join the `orders` and `order_items` tables. Group by order ID and return the number of items per order.

In [29]:
# Your query here
query6 = """ 
select o.order_id, count(*) from orders o
left join order_items oi
    on o.order_id = oi.order_id
group by o.order_id
order by count(*) desc

"""
pd.read_sql(query6, connection)

      order_id  count(*)
0         1612         5
1         1605         5
2         1601         5
3         1593         5
4         1592         5
...        ...       ...
1610        37         1
1611        14         1
1612        10         1
1613         9         1
1614         4         1

[1615 rows x 2 columns]

### Q7. List total revenue per store.

Revenue = quantity * list_price * (1 - discount). Join `orders`, `order_items`, and `stores`, group by store name, and return total revenue.

In [30]:
pd.set_option('display.float_format', '{:.2f}'.format)

# Your query here
query7 = """
select sum(order_items.quantity * order_items.list_price * (1- order_items.discount)) as total_revenue, stores.store_name
from order_items 
join orders on order_items.order_id = orders.order_id
join stores on orders.store_id = stores.store_id
group by stores.store_name
 """
pd.read_sql(query7, connection)

   total_revenue        store_name
0     5215751.28     Baldwin Bikes
1      867542.24     Rowlett Bikes
2     1605823.04  Santa Cruz Bikes

### Q8. Find the top 5 customers who spent the most overall.

Join `customers`, `orders`, and `order_items`. Sum the total spending per customer and return the top five spenders.

In [31]:
# Your query here
pd.set_option('display.float_format', '{:.2f}'.format)

# Your query here
query7 = """
select sum(order_items.quantity * order_items.list_price * (1- order_items.discount)) as total_revenue, stores.store_name
from order_items 
join orders on order_items.order_id = orders.order_id
join stores on orders.store_id = stores.store_id
group by stores.store_name
 """
pd.read_sql(query7, connection)

   total_revenue        store_name
0     5215751.28     Baldwin Bikes
1      867542.24     Rowlett Bikes
2     1605823.04  Santa Cruz Bikes

### Q9. Show the best-selling product in each category.

Join `products`, `order_items`, and `categories`. For each category, identify the product with the highest total quantity sold.

In [32]:
# Your query here
query9 = """ 
WITH category_product_sales AS (
    SELECT
        c.category_name,
        p.product_name,
        SUM(oi.quantity) AS total_sold,
        RANK() OVER (
            PARTITION BY c.category_name
            ORDER BY SUM(oi.quantity) DESC
        ) AS rnk
    FROM categories c
    JOIN products p ON c.category_id = p.category_id
    JOIN order_items oi ON p.product_id = oi.product_id
    GROUP BY c.category_name, p.product_name
)
SELECT category_name, product_name, total_sold
FROM category_product_sales
WHERE rnk = 1
ORDER BY category_name;
"""
pd.read_sql(query9, connection)

,category_name,product_name,total_sold
0,Children Bicycles,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,154
1,Comfort Bicycles,Electra Townie Original 7D - 2015/2016,148
2,Cruisers Bicycles,Electra Cruiser 1 (24-Inch) - 2016,157
3,Cyclocross Bicycles,Surly Straggler 650b - 2016,151
4,Electric Bikes,Trek Conduit+ - 2016,145
5,Mountain Bikes,Surly Ice Cream Truck Frameset - 2016,167
6,Road Bikes,Trek Domane SLR 6 Disc - 2017,43

In [33]:
pd.read_sql(""" 
SELECT
        c.category_name,
        p.product_name,
        SUM(oi.quantity) AS total_sold,
        RANK() OVER (
            PARTITION BY c.category_name
            ORDER BY SUM(oi.quantity) DESC
        ) AS rnk
    FROM categories c
    JOIN products p ON c.category_id = p.category_id
    JOIN order_items oi ON p.product_id = oi.product_id
    GROUP BY c.category_name, p.product_name
""", connection)

,category_name,product_name,total_sold,rnk
0,Children Bicycles,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,154,1
1,Children Bicycles,Electra Girl's Hawaii 1 (16-inch) - 2015/2016,145,2
2,Children Bicycles,Electra Cruiser 1 (24-Inch) - 2016,139,3
3,Children Bicycles,"Electra Girl's Hawaii 1 16"" - 2017",47,4
4,Children Bicycles,Electra Townie 7D (20-inch) - Boys' - 2017,40,5
...,...,...,...,...
302,Road Bikes,Trek Domane SL Frameset Women's - 2018,1,47
303,Road Bikes,Trek Domane SL 5 Women's - 2018,1,47
304,Road Bikes,Trek Domane ALR 3 - 2018,1,47
305,Road Bikes,Trek CrossRip 2 - 2018,1,47
306,Road Bikes,Surly ECR Frameset - 2018,1,47

In [ ]:
pd.read_sql(""" 
WITH category_product_sales AS (SELECT
c.category_name,
p.product_name,
SUM(oi.quantity) AS total_sold
FROM categories c
JOIN products p ON c.category_id = p.category_id
JOIN order_items oi ON p.product_id = oi.product_id
group by c.category_name, p.product_name
)

select category_name, product_name, max(total_sold)
from category_product_sales
group by category_name            
""", connection)

,category_name,product_name,max(total_sold)
0,Children Bicycles,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,154
1,Comfort Bicycles,Electra Townie Original 7D - 2015/2016,148
2,Cruisers Bicycles,Electra Cruiser 1 (24-Inch) - 2016,157
3,Cyclocross Bicycles,Surly Straggler 650b - 2016,151
4,Electric Bikes,Trek Conduit+ - 2016,145
5,Mountain Bikes,Surly Ice Cream Truck Frameset - 2016,167
6,Road Bikes,Trek Domane SLR 6 Disc - 2017,43

### Q10. Identify the employees (staff) who processed the most orders.

Join `staffs` and `orders`. Count the number of orders handled by each staff member and return the results sorted by highest total.

In [45]:
# Your query here
pd.read_sql(""" 
    select concat(first_name," ",last_name) as staffmember, count(o.order_id) as order_count from staffs s
    left join orders o
        on s.store_id = o.store_id
    group by s.staff_id
    order by count(order_id) desc
""", connection)

          staffmember  order_count
0       Venita Daniel         1093
1     Marcelene Boyer         1093
2      Jannette David         1093
3      Virgie Wiggins          348
4       Genna Serrano          348
5     Mireya Copeland          348
6     Fabiola Jackson          348
7  Bernardine Houston          174
8       Layla Terrell          174
9         Kali Vargas          174